* 42's FdF project (wireframe model)
This project aims to teach the basics of 3D graphics project in C, including window management, event handling, colors, textures, etc.
** Graphical library
To help us use the graphics of the computer, we use the MiniLibx library, which was developed internally.

* Time spent
** IN PROGRESS FdF
:PROPERTIES:
:COLUMNS:  %40ITEM(Task) %17EFFORT(Estimated Effort){:} %CLOCKSUM(Time spent)
:Effort_ALL: 0:15 0:30 0:45 1:00 2:00 3:00 4:00 5:00 6:00 7:00 8:00 9:00 10:00 11:00 12:00 13:00 14:00 15:00 16:00 17:00 18:00 19:00 20:00 21:00 22:00 23:00 24:00 25:00 26:00 27:00 28:00 29:00 30:00 31:00 32:00 33:00 34:00 35:00 36:00 37:00 38:00 39:00 40:00 41:00 42:00 43:00 44:00 45:00 46:00 47:00 48:00 49:00 50:00 51:00 52:00 53:00 54:00 55:00 56:00 57:00 58:00 59:00 60:00 61:00 62:00 63:00 64:00 65:00 66:00 67:00 68:00 69:00 70:00 71:00 72:00 73:00 74:00 75:00 76:00 77:00 78:00 79:00 80:00 81:00 82:00 83:00 84:00 85:00 86:00 87:00 88:00 89:00 90:00 91:00 92:00 93:00 94:00 95:00 96:00 97:00 98:00 99:00 100:00
:Effort:   60:00
:END:
*** CODING fdf program
:LOGBOOK:
CLOCK: [2024-05-27 Mon 11:31]--[2024-05-27 Mon 11:40] =>  0:09
CLOCK: [2024-05-20 Mon 19:31]--[2024-05-20 Mon 19:42] =>  0:11
CLOCK: [2024-05-20 Mon 15:14]--[2024-05-20 Mon 18:54] =>  3:40
CLOCK: [2024-05-20 Mon 11:11]--[2024-05-20 Mon 11:27] =>  0:16
CLOCK: [2024-05-20 Mon 10:07]--[2024-05-20 Mon 10:39] =>  0:32
CLOCK: [2024-05-20 Mon 08:53]--[2024-05-20 Mon 09:33] =>  0:40
CLOCK: [2024-05-17 Fri 17:45]--[2024-05-17 Fri 18:15] =>  0:30
CLOCK: [2024-05-17 Fri 16:55]--[2024-05-17 Fri 17:15] =>  0:20
CLOCK: [2024-05-17 Fri 12:30]--[2024-05-17 Fri 15:30] =>  3:00
CLOCK: [2024-05-13 Mon 18:05]--[2024-05-13 Mon 19:37] =>  1:32
:END:
**** CODE Real zoom
:LOGBOOK:
CLOCK: [2024-05-29 Wed 10:52]--[2024-05-29 Wed 11:57] =>  1:05
:END:
+ normalize coordinate system so display begins with center of the map
  :LOGBOOK:
**** CODING Put points with rotations
:LOGBOOK:
CLOCK: [2024-06-04 Tue 18:41]--[2024-06-04 Tue 19:56] =>  1:15
CLOCK: [2024-06-04 Tue 16:13]--[2024-06-04 Tue 18:23] =>  2:10
CLOCK: [2024-06-04 Tue 14:15]--[2024-06-04 Tue 15:50] =>  1:35
CLOCK: [2024-06-04 Tue 10:09]--[2024-06-04 Tue 12:48] =>  2:39
CLOCK: [2024-05-31 Fri 18:31]--[2024-05-31 Fri 19:04] =>  0:33
CLOCK: [2024-05-31 Fri 16:41]--[2024-05-31 Fri 17:12] =>  0:31
CLOCK: [2024-05-31 Fri 15:43]--[2024-05-31 Fri 16:25] =>  0:42
CLOCK: [2024-05-31 Fri 12:57]--[2024-05-31 Fri 14:13] =>  1:16
:END:
**** CODED Convert coords from (0,0) up left to (0,0) at center (for zoom)
CLOSED: [2024-05-30 Thu 11:12]
:LOGBOOK:
CLOCK: [2024-05-29 Wed 14:15]--[2024-05-29 Wed 15:01] =>  0:46
CLOCK: [2024-05-29 Wed 13:04]--[2024-05-29 Wed 13:57] =>  0:53
CLOCK: [2024-05-29 Wed 11:59]--[2024-05-29 Wed 12:27] =>  0:28
CLOCK: [2024-05-28 Tue 21:18]--[2024-05-28 Tue 21:47] =>  0:29
CLOCK: [2024-05-28 Tue 19:54]--[2024-05-28 Tue 21:00] =>  1:06
CLOCK: [2024-05-28 Tue 17:59]--[2024-05-28 Tue 19:25] =>  1:26
:END:
**** CODED color gradient on lines
CLOSED: [2024-05-28 Tue 17:58]
:LOGBOOK:
CLOCK: [2024-05-27 Mon 16:59]--[2024-05-27 Mon 17:30] =>  0:31
CLOCK: [2024-05-27 Mon 14:34]--[2024-05-27 Mon 15:10] =>  0:36
CLOCK: [2024-05-27 Mon 12:16]--[2024-05-27 Mon 13:05] =>  0:49
:END:
**** CODED Draw lines between points
CLOSED: [2024-05-27 Mon 12:15]
:LOGBOOK:
CLOCK: [2024-05-26 Sun 19:04]--[2024-05-26 Sun 21:12] =>  2:08
CLOCK: [2024-05-26 Sun 18:45]--[2024-05-26 Sun 18:56] =>  0:11
CLOCK: [2024-05-26 Sun 16:53]--[2024-05-26 Sun 17:10] =>  0:17
:END:
**** CODED Display points w/out perspective
CLOSED: [2024-05-23 Thu 17:27]
:LOGBOOK:
CLOCK: [2024-05-25 Sat 23:00]--[2024-05-25 Sat 23:56] =>  0:56
CLOCK: [2024-05-23 Thu 10:28]--[2024-05-23 Thu 10:53] =>  0:25
CLOCK: [2024-05-22 Wed 12:40]--[2024-05-22 Wed 14:02] =>  1:22
:END:
**** CODED Parsing
CLOSED: [2024-05-22 Wed 12:39]
SCHEDULED: <2024-05-21 Tue>-<2024-05-23 Thu>
:LOGBOOK:
CLOCK: [2024-05-25 Sat 20:52]--[2024-05-25 Sat 21:14] =>  0:22
CLOCK: [2024-05-25 Sat 19:17]--[2024-05-25 Sat 20:45] =>  1:28
CLOCK: [2024-05-23 Thu 15:23]--[2024-05-23 Thu 16:52] =>  1:29
CLOCK: [2024-05-23 Thu 13:57]--[2024-05-23 Thu 14:09] =>  0:12
CLOCK: [2024-05-21 Tue 22:40]--[2024-05-21 Tue 23:35] =>  0:55
CLOCK: [2024-05-21 Tue 20:15]--[2024-05-21 Tue 22:37] =>  2:22
CLOCK: [2024-05-21 Tue 15:10]--[2024-05-21 Tue 15:48] =>  0:38
CLOCK: [2024-05-21 Tue 11:55]--[2024-05-21 Tue 14:07] =>  2:12
:END:
*** IN PROGRESS think/test/debug/etc
:LOGBOOK:
CLOCK: [2024-06-03 Mon 11:11]--[2024-06-03 Mon 15:00] =>  3:49
CLOCK: [2024-05-31 Fri 16:25]--[2024-05-31 Fri 16:41] =>  0:16
CLOCK: [2024-05-31 Fri 12:10]--[2024-05-31 Fri 12:22] =>  0:12
CLOCK: [2024-05-31 Fri 11:15]--[2024-05-31 Fri 11:42] =>  0:27
CLOCK: [2024-05-30 Thu 14:10]--[2024-05-30 Thu 14:44] =>  0:34
CLOCK: [2024-05-30 Thu 13:02]--[2024-05-30 Thu 13:09] =>  0:07
CLOCK: [2024-05-30 Thu 12:03]--[2024-05-30 Thu 12:40] =>  0:37
CLOCK: [2024-05-30 Thu 11:12]--[2024-05-30 Thu 11:26] =>  0:14
CLOCK: [2024-05-27 Mon 11:40]--[2024-05-27 Mon 12:13] =>  0:33
CLOCK: [2024-05-26 Sun 11:58]--[2024-05-26 Sun 13:27] =>  1:29
CLOCK: [2024-05-25 Sat 09:00]--[2024-05-25 Sat 11:00] =>  2:00
CLOCK: [2024-05-23 Thu 18:10]--[2024-05-23 Thu 18:36] =>  0:26
CLOCK: [2024-05-23 Thu 10:53]--[2024-05-23 Thu 11:14] =>  0:21
:END:
